1cdiplom/src/Documents/ОбслуживаниеКлиента/ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрикрепленныеФайлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1cdiplom/src/AccumulationRegisters/ВыполненныеКлиентуРаботы/ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

1cdiplom/src/Enums/ВидыДоговоровКонтрагентов_Новый/ВидыДоговоровКонтрагентов_Новый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов_Новый</name>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

1cdiplom/src/Documents/ОбслуживаниеКлиента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание Тогда
        Сообщить("Выберите договор с типом 'Абонентское обслуживание'.");
        Возврат;
    КонецЕсли;
    
    Если ДатаПроведенияРабот < Договор.ДатаНачалаДействияДоговора Или ДатаПроведенияРабот > Договор.ДатаОкончанияДействияДоговора Тогда
        Сообщить("Дата документа должна быть в пределах действия договора.");
        Возврат;
    КонецЕсли;
	
	Движения.ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	ТаблицаДляПроведения = ВыполненныеРаботы.Выгрузить();
	ТаблицаДляПроведения.Свернуть("ОписаниеРабот", "ЧасыКОплатеКлиенту");

	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов_Новый.АбонентскоеОбслуживание;

	Для Каждого ТекСтрокаАбонОбсл Из ВыполненныеРаботы Цикл

		Если ТекСтрокаАбонОбсл.ОписаниеРабот = ВидДоговора Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаАбонОбсл.ЧасыКОплатеКлиенту; 
		Движение.СуммаКОплате = Договор.СтоимостьЧасаРаботыСпециалиста*ТекСтрокаАбонОбсл.ЧасыКОплатеКлиенту;
КонецЦикла;
КонецПроцедуры
